app/Controllers/OperateurController.php

SELECT `prefixe`.*, `operateur`.`nom` AS `nom_operateur`
FROM `prefixe`
JOIN `operateur` ON `operateur`.`id` = `prefixe`.`id_operateur`
SELECT *
FROM `operateur`
---
    public function prefixes(): string
    {
        $prefixes = $this->prefixeModel
            ->select('prefixe.*, operateur.nom AS nom_operateur')
            ->join('operateur', 'operateur.id = prefixe.id_operateur')
            ->findAll();

        return view('operateur/prefixes/index', [
            'prefixes'   => $prefixes,
            'operateurs' => $this->operateurModel->findAll(),
        ]);