app/Models/BaremeModel.php

SELECT *
FROM `bareme`
WHERE `id_type_operation` = 1
AND `min` <= 50000
AND `max` >= 50000
 LIMIT 1
---
    public function getTranche(int $idTypeOperation, float $montant): array|null
    {
        return $this->where('id_type_operation', $idTypeOperation)
                    ->where('min <=', $montant)
                    ->where('max >=', $montant)
                    ->first();

SELECT *
FROM `bareme`
WHERE `id_type_operation` = 1
ORDER BY `min` ASC
---
    public function getByTypeOperation(int $idTypeOperation): array
    {
        return $this->where('id_type_operation', $idTypeOperation)
                    ->orderBy('min', 'ASC')
                    ->findAll();