app/Models/ConfigPromotionModel.php

    public function setPourcentage(float $taux): bool
    {
        return (bool) $this->insert([
            'pourcentage'  => $taux,
            'date_modification' => date('Y-m-d H:i:s'),
        ]);
---
INSERT INTO `config_promotion` (`pourcentage`, `date_modification`) VALUES (0, '2026-07-21 07:25:36')