app/Models/PrefixeModel.php

SELECT *
FROM `prefixe`
WHERE `debut_numero` = '034'
 LIMIT 1
---
    public function trouverPrefixe(string $numero): array|null
    {
        $prefixe = substr($numero, 0, 3);
        return $this->where('debut_numero', $prefixe)->first();