app/Models/TransactionsModel.php

    public function faireDepot(int $idClient, float $montant): array
    {
        if ($montant <= 0) {
            return ['success' => false, 'error' => 'Le montant doit être positif.'];
        }

        $typeOpModel = new TypeOperationModel();
        $baremeModel = new BaremeModel();

        $idTypeDepot = $typeOpModel->getIdByType(TypeOperationModel::DEPOT);
        $tranche = $baremeModel->getTranche($idTypeDepot, $montant);

        $frais = $tranche ? (float) $tranche['frais'] : 0.0;

        $data = [
            'numero_transaction' => $this->_genererNumero(),
            'montant' => $montant,
            'frais' => $frais,
            'date_transaction' => date('Y-m-d H:i:s'),
            'id_client' => $idClient,
            'id_destinataire' => null,
            'id_bareme' => $tranche ? (int) $tranche['id'] : null,
        ];

        $this->insert($data);
---
INSERT INTO `transactions` (`numero_transaction`, `montant`, `frais`, `date_transaction`, `id_client`, `id_destinataire`, `id_bareme`) VALUES ('TXN-20260721-977E31', 10000, 0, '2026-07-21 08:18:17', 6, NULL, 1)