app/Models/TypeOperationModel.php

    public function getIdByType(string $type): int|null
    {
        $row = $this->where('type', $type)->first();
---
SELECT *
FROM `type_operation`
WHERE `type` = 'depot'
 LIMIT 1

    public function getAllWithBaremes(): array
    {
        $types = $this->findAll();
---
SELECT *
FROM `type_operation`